<template lang="pug">
div
    h2 閱讀並同意條款
    div.vote-trems.vote-dialog__content
        ul.vote-trems__list
            li 參與者（即本文中所稱「個人」）參加「蜜糖甜心 品牌大使選拔」投票及抽獎活動（以下稱本活動），同意東森購物Buty Baby（以下簡稱本活動主辦單位） 在本活動及其相關事務之範圍內蒐集、處理與利用參與者之個人資料，且參與者本人已詳閱後列本活動主辦單位依個人資料保護法第8條規定所為之告知事項，並同意本活動主辦單位於參與者首次登入投票後繼續分散投票時（同一FACEBOOK帳號最多可投10票，可於同一天內或活動投票期間內分散投票，但每個提案限投1票）， 不再另行告知本個人資料保密措施與告知事項。

            li 於投票活動結束後，主辦單位將依本活動之抽獎辦法從符合資格且已勾選同意參加抽獎並留存資料之投票者中隨機抽出中獎名單。 

            li 本活動主辦單位將對個人資料謹慎保護，並採取必要之保密措施，以維護參與者所提供資料之安全性。本活動主辦單位之個人資料保密措施，係依據個人資料保護法以及主管機關之相關法令辦理，以善盡參與本活動或相關事務人員保密資料之職責。 

            li 一、個人資料之蒐集方式 
                br
                |本活動主辦單位擁有參與者的個人資料，係因參與者參與本活動主辦單位舉辦之第七屆「蜜糖甜心 品牌大使選拔」投票及抽獎活動並提供（或允許存取）資料。本活動主辦單位蒐集參與者的個人資料類別，如您的暱稱、電話號碼、相關投票記錄等，並以本活動往來時所實際蒐集之個人資料為準。參與者可以自由選擇是否提供相關個人資料。若參與者選擇不提供個人資料或是提供不完全時，基於本活動相關業務之執行所需，本活動主辦單位可能無法受理其參與本活動，敬請見諒。 

            li 二、個人資料之儲存、保管及資料安全與維護方式 
                br
                |本活動主辦單位將採取謹慎措施保護參與者資料，並依相關作業規範建立個人資料庫，按業務權責指定專門人員控管資料庫存取，以保護個人資料之安全性。任何未經本活動主辦單位正式授權之人員，絕對禁止接觸參與者的個人資料。 

            li 三、個人資料為利用之期間、地區、對象及方式：
                ol
                    li 期間：
                            ol
                                li 特定目的存續期間。
                                li 依相關法令所定或因執行業務所必須之保存期間或依個別契約約定之保存年限〈以期限最長者為準〉。
                    li 地區：以下第3點所列之利用對象，其國內所在地。
                    li 對象：
                        ol
                            li 本活動主辦單位〈含受其委託處理事務之委外機構〉。
                            li 依法有權機關（如主辦單位之主管機關、司法機關、稅務機關等）。
                    li 方式：符合個人資料保護相關法令以自動化機器或其他非自動化之利用方式。

            li 四、依據個人資料保護法第3條規定，參與者就主辦單位保有參與者之個人資料，得行使下列權利：
                ol
                    li 除有個人資料保護法第10條所規定之例外情形外，得向主辦單位查詢、請求閱覽或請求製給複製本。
                    li 得向主辦單位請求補充或更正個人資料，惟依個人資料保護法施行細則第19條規定，請求者應適當釋明其原因及事實。
                    li 依個人資料保護法第11條第3項規定，個人資料蒐集之特定目的消失或期限屆滿時，得向主辦單位請求刪除、停止處理或利用您的個人資料。惟依該項但書規定，主辦單位因執行業務所必須或經參與者書面同意者，不在此限。

            li 六、參與者如欲行使上述個人資料保護法第3條規定之各項權利，有關如何行使之方式，您得向本活動主辦單位查詢。參與者得選擇是否提供相關個人資料，惟參與者如拒絕提供之個人資料及類別，將無法參與本活動，敬請見諒。

            li 七、本活動主辦單位保有修訂保密措施與相關告知事項之權利，並將於網站或以其他主管機關認定公開揭露之管道公告揭露相關訊息，修訂時亦同；若有其他與保密措施相關之問題，亦可隨時洽詢本活動主辦單位。
    div.vote-dialog__ctrls
        a.vote-btn.pure-button.pure-button-primary(href='voting-forms.html', title='同意', v-on:click="handeClickAgreeBtn($event)") 同意
</template>

<script>
    export default {
        props:[],
        watch: {
        },
        methods: {
            handeClickAgreeBtn: function(e){
                e.preventDefault();
                utilityJS.cookie('argeTrems',true, { expires: 1 });
                this.$emit('open','forms',function(){});    
            }
        }
    }
</script>

<style>

</style>